TexasInstruments/cc32xx_open_sdk/examples/rtos/CC3220SF_LAUNCHXL/demos/network_terminal/cmd_parser.c
/*
 * Copyright (c) 2016, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/* General includes */
#include <stdlib.h>
#include <ti/drivers/net/wifi/simplelink.h>

/* Application includes */
#include "str.h"
#include "cmd_parser.h"
#include "wlan_cmd.h"
#include "netapp_cmd.h"
#include "network_terminal.h"
/* Check NWP generation includes*/
#include <ti/devices/cc32xx/inc/hw_gprcm.h>
#include <ti/devices/cc32xx/inc/hw_memmap.h>
#include <ti/devices/cc32xx/inc/hw_types.h>

/* Application defines */
#define MAX_SSID_ENTRIES            (30)
#define FRAME_TYPE_MASK             (0x0C)
#define DEVICE_YEAR                 (2016)
#define DEVICE_MONTH                (1)
#define DEVICE_DATE                 (6)
#define KEY_LEN_MAX                 (64)
#define MAX_PAYLOAD_SIZE            (1400)
#define FRAME_SUBTYPE_MASK          (0xF0)
#define MAX_PING_SIZE               (1452)
#define DEF_ADVERTISE_PORT          (2525)
#define DEF_ADVERTISE_TTL           (2000)

/******************************************************************************
                  Callback Functions
******************************************************************************/
/*!
    \brief          Parse Scan command.

    This routine takes a ScanCmd_t structure, and fill it's content with
    parameters taken from command line.
    In case of a parsing error or invalid parameters,
    this function sets default values.

    \param          arg         -   Points to command line buffer.
                                    Contains the command line typed by user.

    \param          scanParams  -   Points to command structure provided
                                    by the scan callback.
                                    This structure will later be read
                                    by the scan callback.

    \return         Upon successful completion, the function shall return 0.
                    In case of failure, this function would print error,
                    and show the Scan command help menu.

    \sa             cmdScanCallback
 */
int32_t ParseScanCmd(void *arg, ScanCmd_t *scanParams)
{
    char            *token = NULL;
    char cmdStr[CMD_BUFFER_LEN + 1];
    uint8_t help = FALSE;

    strncpy(cmdStr, (char*)arg, CMD_BUFFER_LEN);
    cmdStr[CMD_BUFFER_LEN] = '\0';
    token = strtok(cmdStr, space_str);

    if(NULL == token)
    {
        help = TRUE;
    }

    while(token)
    {
        if(!strcmp(token, help_optionStr))
        {
            help = TRUE;
        }
        else if(!strcmp(token, n_optionStr))
        {
            token = strtok(NULL, space_str);

            if(token)
            {
                scanParams->numOfentries = (uint8_t)atoi(token);
            }

            if(scanParams->numOfentries > MAX_SSID_ENTRIES ||
               (0 == scanParams->numOfentries))
            {
                scanParams->numOfentries = MAX_SSID_ENTRIES;
            }
        }
        else if(!strcmp(token, ext_optionStr))
        {
            scanParams->extendedRes = TRUE;
        }
        else
        {
            SHOW_WARNING(-1, CMD_ERROR);
            help = TRUE;
            break;
        }
        token = strtok(NULL, " ");
    }

    if(help)
    {
        printScanUsage(arg);
        return(-1);
    }

    return(0);
}

/*!
    \brief          Parse Set policy command.

    This routine takes a SetPolicyCmd_t structure, and fill it's content with
    parameters taken from command line.It sets some default values pre-parsing,
    in order to showcase 'default' parameters.
    In case of a parsing error or invalid parameters,
    this function prints help menu.

    \param          arg              -   Points to command line buffer.
                                         Contains the command line typed by user.

    \param          SetPolicyParams  -   Points to command structure provided
                                         by the set policy callback.
                                         This structure will later be read by
                                         the set policy callback.

    \return         Upon successful completion, the function shall return 0.
                    In case of failure, this function would print error,
                    and show
                    the set scan policy command help menu.

    \sa             cmdSetPolicyCallback
 */
int32_t ParseSetPolicyCmd(void *arg, SetPolicyCmd_t *SetPolicyParams)
{
    char               *token = NULL;
    char cmdStr[CMD_BUFFER_LEN + 1];
    uint8_t help = FALSE;

    strncpy(cmdStr, (char*)arg, CMD_BUFFER_LEN);
    cmdStr[CMD_BUFFER_LEN] = '\0';
    token = strtok(cmdStr, space_str);

