TexasInstruments/cc32xx_open_sdk/examples/rtos/CC3220SF_LAUNCHXL/demos/network_terminal/cmd_parser.c
    if(NULL == token)
    {
        help = TRUE;
    }

    /* Set channel mask and RSSI threshold to default (2.4G) */
    SetPolicyParams->ScanParamConfig.RssiThreshold = RSSI_TH_MAX;
    SetPolicyParams->ScanParamConfig.ChannelsMask = CHANNEL_MASK_ALL;
    /* Set channel mask and RSSI threshold to default (5G) */
    SetPolicyParams->ScanParamConfig5G.RssiThreshold = RSSI_TH_MAX;
    SetPolicyParams->ScanParamConfig5G.ChannelsMask = CHANNEL_MASK_ALL_5G;
    /* Set scan interval to default */
    SetPolicyParams->ScanIntervalinSec = 10;

    while(token)
    {
        if(!strcmp(token, help_optionStr))
        {
            help = TRUE;
        }
        else if(!strcmp(token, h_optionStr))
        {
            token = strtok(NULL, space_str);
            if(token)
            {
                if(!strcmp(token, "YES") || !strcmp(token, "yes"))
                {
                    SetPolicyParams->hiddenSsid = TRUE;
                }
                else if(!strcmp(token, "NO") || !strcmp(token, "no"))
                {
                    SetPolicyParams->hiddenSsid = FALSE;
                }
                else
                {
                    help = TRUE;
                }
            }
        }
        else if(!strcmp(token, i_optionStr))
        {
            token = strtok(NULL, space_str);
            if(token)
            {
                SetPolicyParams->ScanIntervalinSec = (uint16_t)atoi(token);
            }
        }
        else if(!strcmp(token, o_optionStr))
        {
            token = strtok(NULL, space_str);
            if(token)
            {
                if(!strcmp(token, "YES") || !strcmp(token, "yes"))
                {
                    SetPolicyParams->turnOff = TRUE;
                }
            }
        }
        else if(!strcmp(token, c_optionStr))
        {
            token = strtok(NULL, space_str);
            if(token)
            {
                SetPolicyParams->ScanParamConfig.ChannelsMask =
                    (uint16_t)strtol(token, NULL, 16);
            }
        }
        else if(!strcmp(token, d_optionStr))
        {
            token = strtok(NULL, space_str);
            if(token)
            {
                SetPolicyParams->ScanParamConfig5G.ChannelsMask =
                    (unsigned long)strtol(token, NULL, 16);
            }
        }
        else if(!strcmp(token, r_optionStr))
        {
            token = strtok(NULL, space_str);
            if(token)
            {
                SetPolicyParams->ScanParamConfig.RssiThreshold =
                (int32_t)atoi(token);
            }
        }
        else
        {
            SHOW_WARNING(-1, CMD_ERROR);
            help = TRUE;
            break;
        }
        token = strtok(NULL, " ");
    }

    if(help)
    {
        printSetPolicyUsage(arg);
        return(-1);
    }

    return(0);
}

/*!
    \brief          Parse Profile command.

    This routine takes a ProfileCmd_t structure, and fill it's content with
    parameters taken from command line.It sets some default values pre-parsing,
    and checks the parameters validity.
    In case of a parsing error or invalid parameters,
    this function prints help menu.

    \param          arg            -   Points to command line buffer.
                                       Contains the command line typed by user.

    \param          ProfileParams  -   Points to command structure provided
                                       by the connect callback.
                                       This structure will later be read by
                                       the connect callback.

    \return         Upon successful completion, the function shall return 0.
                    In case of failure,this function would print error,
                    and show the set scan policy command help menu.

    \sa             cmdAddProfileCallback
 */
int32_t ParseProfileCmd(void *arg, ProfileCmd_t *ProfileParams)
{
    char                 cmdStr[CMD_BUFFER_LEN + 1];
    char                 *token = NULL;
    char                 *ssid = NULL;
    char                 *password = NULL;
    char                 *security = NULL;
    char                 *mac = NULL;
    char                 *priority = NULL;
    char                 *entUserName = NULL;
    uint8_t              help = FALSE;

    strncpy(cmdStr, (char*) arg, CMD_BUFFER_LEN);
    cmdStr[CMD_BUFFER_LEN] = '\0';
    token = strtok(cmdStr, space_str);

    if(token == NULL)
    {
        help = TRUE;
    }

    ProfileParams->mac = NULL;
    ProfileParams->priority = NULL;

    while(token)
    {
        if(!strcmp(token, help_optionStr))
        {
            help = 1;
        }
        else if(!strcmp(token, s_optionStr))
        {
            ssid = strtok(NULL, "\"");
        }
        else if(!strcmp(token, p_optionStr))
        {
            password = strtok(NULL, "\"");
        }
        else if(!strcmp(token, t_optionStr))
        {
            security = strtok(NULL, space_str);
        }
        else if(!strcmp(token, mac_optionStr))
        {
            mac = strtok(NULL, space_str);
        }
        else if(!strcmp(token, priority_optionStr))
        {
            priority = strtok(NULL, space_str);
        }
        else if(!strcmp(token, ent_optionStr))
        {
            entUserName = strtok(NULL,  "\" ");
        }
        else
        {
            SHOW_WARNING(-1, CMD_ERROR);
            help = TRUE;
            break;
        }
        token = strtok(NULL, space_str);
    }

    if(help)
    {
        printAddProfileUsage(arg);
        return(-1);
    }

    if((ssid != NULL) && (strlen(ssid) <= SL_WLAN_SSID_MAX_LENGTH))
    {
        ProfileParams->ssid = (uint8_t *)calloc((strlen(
                ssid) + 1), sizeof(uint8_t));
        strcpy((char *)ProfileParams->ssid, ssid);
    }
    else
    {
        UART_PRINT("\r\n[Cmd Parser] : Invalid SSID.\n\r");
        return(-1);
    }

    if(mac)
    {
        ProfileParams->mac = (uint8_t *)calloc(6, sizeof(uint8_t));
        macAddressParse(mac, ProfileParams->mac);
    }

    if(priority)
    {
        ProfileParams->priority = (uint32_t *)calloc(1, sizeof(uint32_t));
        if (atoi((const char*)priority) < 0 || atoi((const char*)priority) > 15)
        {
            UART_PRINT("\r\n [Cmd Parser] : Invalid priority. Expected priority 0-15.\n\r");
            return(-1);
        }
        else
        {
            *(ProfileParams->priority) = atoi((const char*)priority);
        }
    }
    else
    {
        ProfileParams->priority = (uint32_t *)calloc(1, sizeof(uint32_t));
        *(ProfileParams->priority) = 0;
    }

