TexasInstruments/cc32xx_open_sdk/examples/rtos/CC3220SF_LAUNCHXL/demos/network_terminal/cmd_parser.c
    if(!security)
    {
        ProfileParams->secParams.Type = SL_WLAN_SEC_TYPE_OPEN;
    }
    else if(!strcmp(security, WPA_str))
    {
        ProfileParams->secParams.Type = SL_WLAN_SEC_TYPE_WPA_WPA2;
    }
    else if(!strcmp(security, WPA2_str))
    {
        ProfileParams->secParams.Type = SL_WLAN_SEC_TYPE_WPA_WPA2;
    }
    else if(!strcmp(security, WEP_str))
    {
        ProfileParams->secParams.Type = SL_WLAN_SEC_TYPE_WEP;
    }
    else if(!strcmp(security, WPS_str) && !password)
    {
        ProfileParams->secParams.Type = SL_WLAN_SEC_TYPE_WPS_PBC;
    }
    else if(!strcmp(security, WPS_str) && password)
    {
        ProfileParams->secParams.Type = SL_WLAN_SEC_TYPE_WPS_PIN;
    }
    else if(!strcmp(security, OPEN_str))
    {
        ProfileParams->secParams.Type = SL_WLAN_SEC_TYPE_OPEN;
    }
    else if(!strcmp(security, WPA3_str))
    {
        ProfileParams->secParams.Type = SL_WLAN_SEC_TYPE_WPA3;
    }
    else if(!strcmp(security, WPA2_PLUS_str))
    {
        ProfileParams->secParams.Type = SL_WLAN_SEC_TYPE_WPA2_PLUS;
    }
    else
    {
        UART_PRINT(
            "\r\n [Cmd Parser] : Parser expected password "
            "parameters [OPEN, WPA/WPA2, WEP, WPS].\n\r");
        return(-1);
    }

    if((password != NULL) && (strlen(password) <= PASSWD_LEN_MAX))
    {
        ProfileParams->secParams.KeyLen = strlen(password);
        ProfileParams->secParams.Key = (signed char *)calloc(
                ProfileParams->secParams.KeyLen + 1, sizeof(uint8_t));
        strncpy((char *)ProfileParams->secParams.Key, password,
                ProfileParams->secParams.KeyLen);
    }
    else if(ProfileParams->secParams.Type != SL_WLAN_SEC_TYPE_OPEN)
    {
        UART_PRINT("\r\n[Cmd Parser] : Invalid Password.\n\r");
        return(-1);
    }

    if(entUserName)
    {
        ProfileParams->secParamsEnt.UserLen = strlen(entUserName);
        ProfileParams->secParamsEnt.User = calloc(
                ProfileParams->secParamsEnt.UserLen,sizeof(uint8_t));
        strcpy((char *) ProfileParams->secParamsEnt.User, entUserName);
        ProfileParams->secParamsEnt.AnonUser = NULL;
        ProfileParams->secParamsEnt.EapMethod =
            SL_WLAN_ENT_EAP_METHOD_PEAP0_MSCHAPv2;
        ProfileParams->secParams.Type = SL_WLAN_SEC_TYPE_WPA_ENT;
        ProfileParams->dateTime.tm_year = DEVICE_YEAR;
        ProfileParams->dateTime.tm_mon = DEVICE_MONTH;
        ProfileParams->dateTime.tm_day = DEVICE_DATE;
    }

    return(0);
}

/*!
    \brief          Parse Get Profile command.

    This routine takes a ProfileCmd_t structure, and fill it's content with
    parameters taken from command line.It sets some default values pre-parsing,
    and checks the parameters validity.
    In case of a parsing error or invalid parameters,
    this function prints help menu.

    \param          arg            -   Points to command line buffer.
                                       Contains the command line typed by user.

    \param          ProfileParams  -   Points to command structure provided
                                       by the connect callback.
                                       This structure will later be read by
                                       the connect callback.

    \return         Upon successful completion, the function shall return the index number.
                    In case of failure,this function would print error,
                    and show the set scan policy command help menu.

    \sa             cmdAddProfileCallback
 */
int32_t ParsegetProfileCmd(void *arg, ProfileCmd_t *ProfileParams)
{
    char       cmdStr[CMD_BUFFER_LEN + 1];
    char       *token = NULL;
    char       *index = NULL;
    int16_t    index_int = 0;
    uint8_t help = FALSE;

    strncpy(cmdStr, (char*) arg, CMD_BUFFER_LEN);
    cmdStr[CMD_BUFFER_LEN] = '\0';
    token = strtok(cmdStr, space_str);

    if(token == NULL)
    {
        help = TRUE;
    }

    while(token)
        {
            if(!strcmp(token, i_optionStr))
            {
                index = strtok(NULL, space_str);
            }
            else
            {
                SHOW_WARNING(-1, CMD_ERROR);
                help = TRUE;
                break;
            }
            token = strtok(NULL, space_str);
        }

    if(help)
    {
        printGetProfileUsage(arg);
        return(-1);
    }

    index_int = atoi((const char*)index);

    return(index_int);
}


/*!
    \brief          Parse Connect command.

    This routine takes a ConnectCmd_t structure, and fill it's content with
    parameters taken from command line.It sets some default values pre-parsing,
    and checks the parameters validity.
    In case of a parsing error or invalid parameters,
    this function prints help menu.

    \param          arg            -   Points to command line buffer.
                                       Contains the command line typed by user.

    \param          ConnectParams  -   Points to command structure provided
                                       by the connect callback.
                                       This structure will later be read by
                                       the connect callback.

    \return         Upon successful completion, the function shall return 0.
                    In case of failure,this function would print error,
                    and show the set scan policy command help menu.

    \sa             cmdWlanConnectCallback
 */
int32_t ParseConnectCmd(void *arg, ConnectCmd_t *ConnectParams)
{
    char cmdStr[CMD_BUFFER_LEN + 1];
    char                 *token = NULL;
    char                 *ssid = NULL;
    char                 *password = NULL;
    char                 *security = NULL;
    char                 *ip = NULL;
    char                 *gw = NULL;
    char                 *dns = NULL;
    char                 *entUserName = NULL;
    uint8_t help = FALSE;

    strncpy(cmdStr, (char*) arg, CMD_BUFFER_LEN);
    cmdStr[CMD_BUFFER_LEN] = '\0';
    token = strtok(cmdStr, space_str);

