TexasInstruments/cc32xx_open_sdk/examples/rtos/CC3220SF_LAUNCHXL/demos/network_terminal/cmd_parser.c
    if(token == NULL)
    {
        help = TRUE;
    }

    ConnectParams->ip = NULL;
    ConnectParams->dns = NULL;
    ConnectParams->gw = NULL;

    while(token)
    {
        if(!strcmp(token, help_optionStr))
        {
            help = 1;
        }
        else if(!strcmp(token, s_optionStr))
        {
            ssid = strtok(NULL, "\"");
        }
        else if(!strcmp(token, p_optionStr))
        {
            password = strtok(NULL, "\"");
        }
        else if(!strcmp(token, t_optionStr))
        {
            security = strtok(NULL, space_str);
        }
        else if(!strcmp(token, ip_optionStr))
        {
            ip = strtok(NULL, space_str);
        }
        else if(!strcmp(token, dns_optionStr))
        {
            dns = strtok(NULL, space_str);
        }
        else if(!strcmp(token, gw_optionStr))
        {
            gw = strtok(NULL, space_str);
        }
        else if(!strcmp(token, ent_optionStr))
        {
            entUserName = strtok(NULL,  "\" ");
        }
        else
        {
            SHOW_WARNING(-1, CMD_ERROR);
            help = TRUE;
            break;
        }
        token = strtok(NULL, space_str);
    }

    if(help)
    {
        printWlanConnectUsage(arg);
        return(-1);
    }

    if((ssid != NULL) && (strlen(ssid) <= SL_WLAN_SSID_MAX_LENGTH))
    {
        ConnectParams->ssid = (uint8_t *)calloc(sizeof(uint8_t),strlen(
                                                    ssid) + 1);
        strcpy((char *)ConnectParams->ssid, ssid);
    }
    else
    {
        UART_PRINT("\r\n[Cmd Parser] : Invalid SSID.\n\r");
        return(-1);
    }

    if(ip)
    {
        ConnectParams->ip = calloc(sizeof(uint8_t),strlen(ip));
        strcpy((char *)ConnectParams->ip, ip);
    }

    if(gw)
    {
        ConnectParams->gw = calloc(sizeof(uint8_t),strlen(gw));
        strcpy((char *)ConnectParams->gw, gw);
    }

    if(dns)
    {
        ConnectParams->dns = calloc(sizeof(uint8_t),strlen(dns));
        strcpy((char *)ConnectParams->dns, dns);
    }

    if(!security)
    {
        ConnectParams->secParams.Type = SL_WLAN_SEC_TYPE_OPEN;
    }
    else if(!strcmp(security, WPA_str))
    {
        ConnectParams->secParams.Type = SL_WLAN_SEC_TYPE_WPA_WPA2;
    }
    else if(!strcmp(security, WPA2_str))
    {
        ConnectParams->secParams.Type = SL_WLAN_SEC_TYPE_WPA_WPA2;
    }
    else if(!strcmp(security, WEP_str))
    {
        ConnectParams->secParams.Type = SL_WLAN_SEC_TYPE_WEP;
    }
    else if(!strcmp(security, WPS_str) && !password)
    {
        ConnectParams->secParams.Type = SL_WLAN_SEC_TYPE_WPS_PBC;
    }
    else if(!strcmp(security, WPS_str) && password)
    {
        ConnectParams->secParams.Type = SL_WLAN_SEC_TYPE_WPS_PIN;
    }
    else if(!strcmp(security, OPEN_str))
    {
        ConnectParams->secParams.Type = SL_WLAN_SEC_TYPE_OPEN;
    }
    else if(!strcmp(security, WPA3_str))
    {
        ConnectParams->secParams.Type = SL_WLAN_SEC_TYPE_WPA3;
    }
    else if(!strcmp(security, WPA2_PLUS_str))
    {
        ConnectParams->secParams.Type = SL_WLAN_SEC_TYPE_WPA2_PLUS;
    }
    else
    {
        UART_PRINT(
            "\r\n [Cmd Parser] : Parser expected security type "
            "parameter [OPEN, WEP, WPA, WPA2, WPA3, WPS].\n\r");
        return(-1);
    }

    if((password != NULL) && (strlen(password) <= PASSWD_LEN_MAX))
    {
        ConnectParams->secParams.KeyLen = strlen(password);
        ConnectParams->secParams.Key = (signed char *)calloc(
            sizeof(uint8_t), ConnectParams->secParams.KeyLen + 1);
        strncpy((char *)ConnectParams->secParams.Key, password,
                ConnectParams->secParams.KeyLen);
    }
    else if(ConnectParams->secParams.Type != SL_WLAN_SEC_TYPE_OPEN)
    {
        UART_PRINT("\r\n[Cmd Parser] : Invalid Password.\n\r");
        return(-1);
    }

    if(entUserName)
    {
        ConnectParams->secParamsEnt.UserLen = strlen(entUserName);
        ConnectParams->secParamsEnt.User = calloc(
            sizeof(uint8_t), ConnectParams->secParamsEnt.UserLen);
        strcpy((char *) ConnectParams->secParamsEnt.User, entUserName);
        ConnectParams->secParamsEnt.AnonUser = NULL;
        ConnectParams->secParamsEnt.EapMethod =
            SL_WLAN_ENT_EAP_METHOD_PEAP0_MSCHAPv2;
        ConnectParams->secParams.Type = SL_WLAN_SEC_TYPE_WPA_ENT;
        ConnectParams->dateTime.tm_year = DEVICE_YEAR;
        ConnectParams->dateTime.tm_mon = DEVICE_MONTH;
        ConnectParams->dateTime.tm_day = DEVICE_DATE;
    }

    return(0);
}

/*!
    \brief          Free Connect command.

    This routine takes a ConnectCmd_t structure,
    and free all memory that was
    allocated in ParseConnectCmd.

    \param          ConnectParams  -
    Points to command structure provided by the connect callback.

    \return         void

    \sa             cmdWlanConnectCallback
 */
void FreeConnectCmd(ConnectCmd_t *ConnectParams)
{
    if(ConnectParams->ssid != NULL)
    {
        free(ConnectParams->ssid);
        ConnectParams->ssid = NULL;
    }

    if(ConnectParams->ip != NULL)
    {
        free(ConnectParams->ip);
        ConnectParams->ip = NULL;
    }

    if(ConnectParams->gw != NULL)
    {
        free(ConnectParams->gw);
        ConnectParams->gw = NULL;
    }

    if(ConnectParams->dns != NULL)
    {
        free(ConnectParams->dns);
        ConnectParams->dns = NULL;
    }

    if(ConnectParams->secParams.Key != NULL)
    {
        free(ConnectParams->secParams.Key);
        ConnectParams->secParams.Key = NULL;
    }

    if(ConnectParams->secParamsEnt.User != NULL)
    {
        free(ConnectParams->secParamsEnt.User);
        ConnectParams->secParamsEnt.User = NULL;
    }

    return;
}

/*!
    \brief          Free Profile command.

    This routine takes a ProfileCmd_t structure,
    and free all memory that was
    allocated in ParseProfileCmd.

    \param          ProfileParams  -
    Points to command structure provided by the add profile callback.

    \return         void

