TexasInstruments/cc32xx_open_sdk/examples/rtos/CC3220SF_LAUNCHXL/demos/network_terminal/cmd_parser.c
    \sa             cmdWlanaddProfileCallback
 */
void FreeProfileCmd(ProfileCmd_t *ProfileParams)
{
    if(ProfileParams->ssid != NULL)
    {
        free(ProfileParams->ssid);
        ProfileParams->ssid = NULL;
    }

    if(ProfileParams->mac != NULL)
    {
        free(ProfileParams->mac);
        ProfileParams->mac = NULL;
    }

    if(ProfileParams->priority != NULL)
    {
        free(ProfileParams->priority);
        ProfileParams->priority = NULL;
    }

    if(ProfileParams->secParams.Key != NULL)
    {
        free(ProfileParams->secParams.Key);
        ProfileParams->secParams.Key = NULL;
    }

    if(ProfileParams->secParamsEnt.User != NULL)
    {
        free(ProfileParams->secParamsEnt.User);
        ProfileParams->secParamsEnt.User = NULL;
    }

    return;
}

/*!
    \brief          Check if the AllowedChannelsFor5GhzAP array
                    contain the candidate channel

    This function takes the channel that received from user,
    in case of NWP generation compatible with cc3235,
    check if that channel is allowed according to
    pre-configured allowed channels at AllowedChannelsFor5GhzAP array.

    \param          *AllowedChannelsFor5GhzAP  -   Point to pre-configured
                                                 allowed channels.

    \param          length  -                    Length of
                                                 AllowedChannelsFor5GhzAP.

    \param          channel -                    The candidate channel.

    \return         If AllowedChannelsFor5GhzAP contain the
                    channel return 1 (true),
                    if AllowedChannelsFor5GhzAP does not contain
                    the channel return 0 (false).
 */
uint8_t isChannelAt(uint8_t *AllowedChannelsFor5GhzAP,
                    uint32_t length,
                    uint8_t channel                   )
{
    uint32_t i;
    uint8_t  ret = 0;

    for(i = 0; i < length; i++)
    {
        if(channel == AllowedChannelsFor5GhzAP[i])
        {
            ret = 1;
            return ret;
        }
    }
    return ret;
}
/*!
    \brief          Parse Start AP command.

    This routine takes a StartApCmd_t structure, and fill it's content with
    parameters taken from command line. It sets some default values pre-parsing,
    and checks the parameters validity.
    In case of a parsing error or invalid parameters,
    this function prints help menu.

    \param          arg            -   Points to command line buffer.
                                       Contains the command line typed by user.

    \param          StartApParams  -   Points to command structure provided
                                       by the connect callback.
                                       This structure will later be read by
                                       the Start AP callback.

    \return         Upon successful completion, the function shall return 0.
                    In case of failure, this function would print error,
                    and show the set Start AP command help menu.

    \sa             cmdWlanStartApCallback
 */
int32_t ParseStartApCmd(void *arg, StartApCmd_t *StartApParams)
{
    char    cmdStr[CMD_BUFFER_LEN + 1];
    char    *token;
    char    *ssid = NULL;
    char    *password = NULL;
    char    *security = NULL;
    uint8_t cc3235 = FALSE;
    uint8_t AllowedChannelsFor5GhzAP [4] = {36,40,44,48};
    uint8_t help = FALSE;
    uint8_t isSupportedChannel = FALSE;

    strncpy(cmdStr, (char*) arg, CMD_BUFFER_LEN);
    cmdStr[CMD_BUFFER_LEN] = '\0';
    token = strtok(cmdStr, space_str);

    if(token == NULL)
    {
        help = TRUE;
    }

    /* Set default parameters */
    StartApParams->sta_limit = 4;
    StartApParams->hidden = FALSE;
    StartApParams->tx_pow = 0;
    StartApParams->channel = 1;

    while(token)
    {
        if(!strcmp(token, help_optionStr))
        {
            help = TRUE;
        }
        else if(!strcmp(token, s_optionStr))
        {
            ssid = strtok(NULL, "\"");
        }
        else if(!strcmp(token, p_optionStr))
        {
            password = strtok(NULL, "\"");
        }
        else if(!strcmp(token, t_optionStr))
        {
            security = strtok(NULL, space_str);
        }
        else if(!strcmp(token, h_optionStr))
        {
            token = strtok(NULL, space_str);
            if(token)
            {
                if(!strcmp(token, "YES") || !strcmp(token, "yes"))
                {
                    StartApParams->hidden = TRUE;
                }
                else if(!strcmp(token, "NO") || !strcmp(token, "no"))
                {
                    StartApParams->hidden = FALSE;
                }
                else
                {
                    UART_PRINT(
                        "\r\n [Cmd Parser] : invalid Parameter for hidden "
                        "AP option. Using default (Not hidden).\n\r");
                    StartApParams->hidden = FALSE;
                }
            }
        }
        else if(!strcmp(token, c_optionStr))
        {
            token = strtok(NULL, space_str);
            if(token)
            {
                StartApParams->channel = atoi(token);
            }

            /* Check NWP generation */
            if((HWREG(GPRCM_BASE + GPRCM_O_GPRCM_DIEID_READ_REG4) >> 24) & 0x02)
            {
                cc3235 = TRUE;
            }

            /* Check if the configured channel is supported 
               (according to NWP generation) */
            if( ((0 < StartApParams->channel) && (StartApParams->channel < 13)) 
                || (cc3235 &&
               (isChannelAt(AllowedChannelsFor5GhzAP,
                sizeof(AllowedChannelsFor5GhzAP)/sizeof(uint8_t),
                StartApParams->channel))) )
            {
                isSupportedChannel = TRUE;
            }

            /* In case of wrong channel configuration
               go to default channel (1)  */
            if(isSupportedChannel == (FALSE))
            {
                UART_PRINT("\r\n [Cmd Parser] : invalid Parameter for channel"
                 " option. Using default (1).\n\r");
                StartApParams->channel = 1;
            }
        }
        else if(!strcmp(token, txpow_optionStr))
        {
            token = strtok(NULL, space_str);
            if(token)
            {
                StartApParams->tx_pow = atoi(token);
            }

            if(StartApParams->tx_pow > 15)
            {
                UART_PRINT(
                   "\r\n [Cmd Parser] : invalid Parameter for tx power option."
                   " Using default (0).\n\r");
                StartApParams->tx_pow = 0;
            }
        }
        else if(!strcmp(token, l_optionStr))
        {
            token = strtok(NULL, space_str);
            if(token)
            {
                StartApParams->sta_limit = atoi(token);
            }

            if((StartApParams->sta_limit < 1) ||
            (StartApParams->sta_limit > 4))
            {
                UART_PRINT(
                    "\r\n [Cmd Parser] : invalid Parameter for station limit "
                    "option. Using default (4).\n\r");
                StartApParams->sta_limit = 4;
            }
        }
        else
        {
            SHOW_WARNING(-1, CMD_ERROR);
            help = TRUE;
            break;
        }
        token = strtok(NULL, space_str);
    }

    if ( (StartApParams->tx_pow != 0)    &&
         ((StartApParams->channel == 36) ||
          (StartApParams->channel == 40) ||
          (StartApParams->channel == 44) ||
          (StartApParams->channel == 48)) )
    {
        SHOW_WARNING(-1,
           "tx power can be set for 2.4GHz channels only.");
        help = TRUE;
    }

    if(help)
    {
        printWlanStartApUsage(arg);
        return(-1);
    }

    if((NULL == ssid) || (strlen(ssid) >= SL_WLAN_SSID_MAX_LENGTH))
    {
        UART_PRINT(
            "\r\n [Cmd Parser] : invalid Parameter for SSID - Should be max"
            " 31 characters.\n\r");
        printWlanStartApUsage(arg);
        return(-1);
    }
    else
    {
        StartApParams->ssid = (uint8_t *)calloc(strlen(ssid)+1,sizeof(uint8_t));
        strcpy((char *)StartApParams->ssid, ssid);
    }

    if(password != NULL)
    {
        StartApParams->secParams.KeyLen = strlen(password)+1;

        if((StartApParams->secParams.KeyLen >= KEY_LEN_MAX) ||
           (StartApParams->secParams.KeyLen < PASSWD_LEN_MIN))
        {
            UART_PRINT(
                "\r\n [Cmd Parser] : Key length invalid - "
                "Should be in range: [8,63].\n\r");
            return(-1);
        }

