TexasInstruments/cc32xx_open_sdk/examples/rtos/CC3220SF_LAUNCHXL/demos/network_terminal/cmd_parser.c
        StartApParams->secParams.Key =
            (signed char *)calloc(StartApParams->secParams.KeyLen, sizeof(uint8_t));
        strcpy((char *)StartApParams->secParams.Key, password);
    }

    if(!security)
    {
        StartApParams->secParams.Type = SL_WLAN_SEC_TYPE_OPEN;
    }
    else if(!strcmp(security, WPAWPA2_str))
    {
        StartApParams->secParams.Type = SL_WLAN_SEC_TYPE_WPA_WPA2;
    }
    else if(!strcmp(security, WEP_str))
    {
        StartApParams->secParams.Type = SL_WLAN_SEC_TYPE_WEP;
    }
    else if(!strcmp(security, OPEN_str))
    {
        StartApParams->secParams.Type = SL_WLAN_SEC_TYPE_OPEN;
    }
    else
    {
        UART_PRINT(
            "\r\n [Cmd Parser] : Parser expected password parameters"
            " [OPEN, WPA/WPA2, WEP, WPS].\n\r");
        return(-1);
    }

    return(0);
}

/*!
    \brief          Free Start AP command.

    This routine takes a StartApCmd_t structure, and free all memory that was
    allocated in ParseStartApCmd.

    \param          StartApParams  -
                Points to command structure provided by the Start AP callback.

    \return         void

    \sa             cmdWlanStartApCallback
 */
void FreeStartApCmd(StartApCmd_t *StartApParams)
{
    if(StartApParams->ssid != NULL)
    {
        free(StartApParams->ssid);
        StartApParams->ssid = NULL;
    }

    if(StartApParams->secParams.Key != NULL)
    {
        free(StartApParams->secParams.Key);
        StartApParams->secParams.Key = NULL;
    }

    return;
}

/*!
    \brief          Parse Cmd.

    This routine is a general command parser,
    used with commands that has no parameters to parse.
    such an example is 'wlandisconnect'.

    \param        arg         -   Points to command line buffer.
                                  Contains the command line typed by user.

    \return       Upon successful completion, the function shall return 0.
                  In case of failure, this function would return -1.
                  It's the callback's responsibility to check the return value,
                  and print the help for this command.

    \sa           cmdConnectCallback, cmdDisableFilterCallback,
                  cmdP2PModecallback, cmdP2PStopcallback
 */
int32_t ParseCmd(void *arg)
{
    char             *token = NULL;
    char cmdStr[CMD_BUFFER_LEN + 1];
    uint8_t help = FALSE;

    strncpy(cmdStr, (char*)arg, CMD_BUFFER_LEN);
    cmdStr[CMD_BUFFER_LEN] = '\0';
    token = strtok(cmdStr, space_str);

    while(token)
    {
        if(!strcmp(token, help_optionStr))
        {
            help = TRUE;
        }
        else
        {
            SHOW_WARNING(-1, CMD_ERROR);
            help = TRUE;
            break;
        }
        token = strtok(NULL, " ");
    }

    if(help)
    {
        return(-1);
    }

    return(0);
}

/*!
    \brief          Parse Create filter command.

   This routine takes a CreateFilterCmd_t structure, and fill it's content with
   parameters taken from command line. It checks the parameters validity.
   In case of a parsing error or invalid parameters,
   this function prints help menu.

   \param          arg               - Points to command line buffer.
                                       Contains the command line typed by user.

   \param          CreateFilterParams - Points to command structure
                                        provided by the create filter callback.
                                        This structure will later be read by
                                        the create filter callback.

    \return         Upon successful completion, the function shall return 0.
                    In case of failure, this function would print error, and show
                    the set createfilter command help menu.

    \sa             cmdCreateFilterCallback
 */
int32_t ParseCreateFilterCmd(void *arg,  CreateFilterCmd_t *CreateFilterParams)
{
    int32_t ret = -1;
    uint8_t help = FALSE;
    int32_t offset = -1;
    uint32_t patternLen = 0;
    uint8_t Frametype = 0;
    uint32_t ip4add = 0;
    uint8_t hostEvent = FALSE;
    char                    *filterType = NULL;
    char                    *cValue = NULL;
    char cmdStr[CMD_BUFFER_LEN + 1];
    char                    *token = NULL;

    strncpy(cmdStr, (char*)arg, CMD_BUFFER_LEN);
    cmdStr[CMD_BUFFER_LEN] = '\0';
    token = strtok(cmdStr, space_str);

    if(token == NULL)
    {
        help = TRUE;
    }

    while(token)
    {
        if(!strcmp(token, (char*)&help_optionStr))
        {
            help = TRUE;
        }
        else if(!strcmp(token, f_optionStr))
        {
            filterType = strtok(NULL, space_str);
        }
        else if(!strcmp(token, v_optionStr))
        {
            cValue = strtok(NULL, space_str);
        }
        else if(!strcmp(token, e_optionStr))
        {
            token = strtok(NULL, space_str);

            if(token)
            {
                if(!strcmp(token, "equals") || !strcmp(token, "EQUALS"))
                {
                    CreateFilterParams->rule.Header.CompareFunc =
                        SL_WLAN_RX_FILTER_CMP_FUNC_EQUAL;
                }
                else if(!strcmp(token,
                                "not_equals") || !strcmp(token, "NOT_EQUALS"))
                {
                    CreateFilterParams->rule.Header.CompareFunc =
                        SL_WLAN_RX_FILTER_CMP_FUNC_NOT_EQUAL_TO;
                }
                else
                {
                    UART_PRINT(
                        "\r\n [Cmd Parser] : Invalid option for"
                        " Comparison type.\n\r");
                    help = TRUE;
                    break;
                }
            }
        }
        else if(!strcmp(token, a_optionStr))
        {
            token = strtok(NULL, (char*)&space_str);
            if(token)
            {
                if(!strcmp(token, "drop") || !strcmp(token, "DROP"))
                {
                    CreateFilterParams->action.Type =
                        SL_WLAN_RX_FILTER_ACTION_DROP;
                }
                else if(!strcmp(token, "event") || !strcmp(token, "EVENT"))
                {
                    CreateFilterParams->action.Type =
                        SL_WLAN_RX_FILTER_ACTION_EVENT_TO_HOST;
                    hostEvent = TRUE;
                }
                else if(!strcmp(token, "pass") || !strcmp(token, "PASS"))
                {
                    CreateFilterParams->action.Type =
                        SL_WLAN_RX_FILTER_ACTION_NULL;
                }
                else
                {
                    UART_PRINT(
                        "\r\n [Cmd Parser] : Invalid option for action type."
                        " Using default: (pass).\n\r");
                    CreateFilterParams->action.Type =
                        SL_WLAN_RX_FILTER_ACTION_NULL;
                }
            }
            else
            {
                UART_PRINT(
                    "\r\n [Cmd Parser] : Invalid option for action type.\n\r");
                help = TRUE;
                break;
            }
        }
        else if(!strcmp(token, (char*)&m_optionStr))
        {
            token = strtok(NULL, (char*)space_str);

            if(token)
            {
                if(!strcmp(token, "L1"))
                {
                    CreateFilterParams->rule.Header.Field =
                        SL_WLAN_RX_FILTER_HFIELD_L1_PAYLOAD_PATTERN;
                    CreateFilterParams->trigger.ConnectionState =
                        SL_WLAN_RX_FILTER_STATE_STA_NOT_CONNECTED;
                    CreateFilterParams->trigger.Role =
                        SL_WLAN_RX_FILTER_ROLE_TRANCIEVER;
                }
                else if(!strcmp(token, "L4_CON"))
                {
                    CreateFilterParams->rule.Header.Field =
                        SL_WLAN_RX_FILTER_HFIELD_L4_PAYLOAD_PATTERN;
                    CreateFilterParams->trigger.ConnectionState =
                        SL_WLAN_RX_FILTER_STATE_STA_CONNECTED;
                    CreateFilterParams->trigger.Role =
                        SL_WLAN_RX_FILTER_ROLE_STA;
                }
                else if(!strcmp(token, "L4"))
                {
                    CreateFilterParams->rule.Header.Field =
                        SL_WLAN_RX_FILTER_HFIELD_L4_PAYLOAD_PATTERN;
                    CreateFilterParams->trigger.ConnectionState =
                        SL_WLAN_RX_FILTER_STATE_STA_NOT_CONNECTED;
                    CreateFilterParams->trigger.Role =
                        SL_WLAN_RX_FILTER_ROLE_STA;
                }
                else
                {
                    UART_PRINT(
                        "\r\n [Cmd Parser] : Invalid option for 'Mode'"
                        " argument. Using default (L4_CON).\n\r");
                    CreateFilterParams->rule.Header.Field =
                        SL_WLAN_RX_FILTER_HFIELD_L4_PAYLOAD_PATTERN;
                    CreateFilterParams->trigger.ConnectionState =
                        SL_WLAN_RX_FILTER_STATE_STA_CONNECTED;
                    CreateFilterParams->trigger.Role =
                        SL_WLAN_RX_FILTER_ROLE_STA;
                }
            }
            else
            {
                UART_PRINT(
                    "\r\n [Cmd Parser] : Invalid option for "
                    "'Mode' argument.\n\r");
                help = TRUE;
                break;
            }
        }
        else if(!strcmp(token, (char*)&o_optionStr))
        {
            token = strtok(NULL, (char*)space_str);

            if(token)
            {
                offset = (int32_t)atol((const char*)token);
            }
            else
            {
                offset = 0;
                UART_PRINT(
                    "\r\n [Cmd Parser] : Invalid option for 'Offset' "
                    "argument. Using default: (0)\n\r");
            }
        }
        /* USER event ID goes here */
        else if(!strcmp(token, (char*)&i_optionStr))
        {
            token = strtok(NULL, space_str);

            if(token)
            {
                CreateFilterParams->trigger.ParentFilterID = (char)atol(token);
            }
        }
        else
        {
            SHOW_WARNING(-1, CMD_ERROR);
            help = TRUE;
            break;
        }
        token = strtok(NULL, " ");
    }

    if(help)
    {
        printCreateFilterUsage(arg);
        return(-1);
    }

    if((filterType == NULL) || (cValue == NULL))
    {
        UART_PRINT(
            "\r\n [Cmd Parser] : Please enter valid filter type"
            " and compare value.\n\r");
        printCreateFilterUsage(arg);
        return(-1);
    }

    /* Set filter rule type as basic header filter. */
    CreateFilterParams->ruleType = SL_WLAN_RX_FILTER_HEADER;

    /* Comparison is done as binary numbers rather than by ASCII characters */
    CreateFilterParams->flags = SL_WLAN_RX_FILTER_BINARY;

    /* Set Header field according to filter type */
    if(!strcmp((char*)filterType, (char*)SOURCE_MAC_str))
    {
        CreateFilterParams->rule.Header.Field =
            SL_WLAN_RX_FILTER_HFIELD_MAC_SRC_ADDR;

