TexasInstruments/cc32xx_open_sdk/examples/rtos/CC3220SF_LAUNCHXL/demos/network_terminal/cmd_parser.c
        memset(CreateFilterParams->rule.Header.Args.Mask, 0xFF,
               SL_WLAN_BSSID_LENGTH);

        ret = macAddressParse(cValue,
                              CreateFilterParams->rule.Header.Args.Value.Mac[0]);
        ASSERT_ON_ERROR(ret, CMD_ERROR);
    }
    else if(!strcmp((char*)filterType, (char*)DESTINATION_MAC_str))
    {
        CreateFilterParams->rule.Header.Field =
            SL_WLAN_RX_FILTER_HFIELD_MAC_DST_ADDR;

        memset(CreateFilterParams->rule.Header.Args.Mask, 0xFF,
               SL_WLAN_BSSID_LENGTH);

        ret = macAddressParse(cValue,
                              CreateFilterParams->rule.Header.Args.Value.Mac[0]);
        ASSERT_ON_ERROR(ret, CMD_ERROR);
    }
    else if(!strcmp((char*)filterType, (char*)BSSID_str))
    {
        CreateFilterParams->rule.Header.Field = SL_WLAN_RX_FILTER_HFIELD_BSSID;

        memset(CreateFilterParams->rule.Header.Args.Mask, 0xFF,
               SL_WLAN_BSSID_LENGTH);

        ret = macAddressParse(
            cValue, CreateFilterParams->rule.Header.Args.Value.Bssid[0]);
        ASSERT_ON_ERROR(ret, CMD_ERROR);
    }
    else if(!strcmp((char*)filterType, (char*)S_IP_str))
    {
        CreateFilterParams->rule.Header.Field =
            SL_WLAN_RX_FILTER_HFIELD_IPV4_SRC_ADDR;

        token = strchr((char *)cValue, ':');
        if(token)
        {
            /* Ipv6 */
            ret = ipv6AddressParse(
                cValue, CreateFilterParams->rule.Header.Args.Value.Ipv6[0]);
            memset(CreateFilterParams->rule.Header.Args.Mask, 0xFF,
                   IPV6_ADDR_LEN);
        }
        else
        {
            /* Ipv4 */
            ret = ipv4AddressParse(cValue, &ip4add);
            CreateFilterParams->rule.Header.Args.Value.Ipv4[0][0] =
                (uint8_t)(ip4add >> 24);
            CreateFilterParams->rule.Header.Args.Value.Ipv4[0][1] =
                (uint8_t)(ip4add >> 16);
            CreateFilterParams->rule.Header.Args.Value.Ipv4[0][2] =
                (uint8_t)(ip4add >> 8);
            CreateFilterParams->rule.Header.Args.Value.Ipv4[0][3] =
                (uint8_t)(ip4add);

            memset(CreateFilterParams->rule.Header.Args.Mask, 0xFF,
                   IPV4_ADDR_LEN);
        }
        ASSERT_ON_ERROR(ret, CMD_ERROR);
    }
    else if(!strcmp((char*)filterType, (char*)D_IP_str))
    {
        CreateFilterParams->rule.Header.Field =
            SL_WLAN_RX_FILTER_HFIELD_IPV4_DST_ADDR;
        token = strchr((char*)cValue, ':');
        if(token)
        {
            /* Ipv6 */
            ret = ipv6AddressParse(
                cValue, CreateFilterParams->rule.Header.Args.Value.Ipv6[0]);
            memset(CreateFilterParams->rule.Header.Args.Mask, 0xFF,
                   IPV6_ADDR_LEN);
        }
        else
        {
            /* Ipv4 */
            ip4add = 0;

            ret = ipv4AddressParse(cValue, &ip4add);
            CreateFilterParams->rule.Header.Args.Value.Ipv4[0][0] =
                (uint8_t)(ip4add >> 24);
            CreateFilterParams->rule.Header.Args.Value.Ipv4[0][1] =
                (uint8_t)(ip4add >> 16);
            CreateFilterParams->rule.Header.Args.Value.Ipv4[0][2] =
                (uint8_t)(ip4add >> 8);
            CreateFilterParams->rule.Header.Args.Value.Ipv4[0][3] =
                (uint8_t)(ip4add);

            memset(CreateFilterParams->rule.Header.Args.Mask, 0xFF,
                   IPV4_ADDR_LEN);
        }
        ASSERT_ON_ERROR(ret, CMD_ERROR);
    }
    else if(!strcmp((char*)filterType, (char*)FRAME_TYPE_str))
    {
        CreateFilterParams->rule.Header.Field =
            SL_WLAN_RX_FILTER_HFIELD_FRAME_TYPE;

        /* check the frame type validity */
        /* There are 3 frame types: (0 - management, 1 - Control, 2 - Data) */
        if(!strcmp(cValue, "management"))
        {
            ret = 0;
            CreateFilterParams->rule.Header.Args.Value.Frametype[0] = 0;
        }
        else if(!strcmp(cValue, "control"))
        {
            ret = 0;
            CreateFilterParams->rule.Header.Args.Value.Frametype[0] = 1;
        }
        else if(!strcmp(cValue, "data"))
        {
            ret = 0;
            CreateFilterParams->rule.Header.Args.Value.Frametype[0] = 2;
        }
        ASSERT_ON_ERROR(ret, CMD_ERROR);

        CreateFilterParams->rule.Header.Args.Value.Frametype[0] |=
            FRAME_TYPE_MASK;
    }
    else if(!strcmp((char*)filterType, (char*)FRAME_SUBTYPE_str))
    {
        if(CreateFilterParams->trigger.ParentFilterID == 0)
        {
            UART_PRINT(
                "\r\n [Cmd Parser] : Parent frame type filter ID "
                "is required for frame sub-type filter.\n\r");
            return(-1);
        }
        else
        {
            /* check frame sub type validity */
            ret = hexbyteStrtoASCII(cValue, &Frametype);
            ret = CheckSubFrameType(&Frametype);

            if(0 != ret)
            {
                UART_PRINT(
                    "\r\n [Cmd Parser] : frame sub-type argument is invalid."
                    " Supported sub type codes:\n\r");
                printFrameSubTyps();
                return(-1);
            }
        }

        CreateFilterParams->rule.Header.Field =
            SL_WLAN_RX_FILTER_HFIELD_FRAME_SUBTYPE;
        memset(&CreateFilterParams->rule.Header.Args.Mask, FRAME_SUBTYPE_MASK,
               1);

        ret = hexbyteStrtoASCII(
            cValue, CreateFilterParams->rule.Header.Args.Value.FrameSubtype);
        ASSERT_ON_ERROR(ret, CMD_ERROR);
        CreateFilterParams->rule.Header.Args.Value.FrameSubtype[0] &=
            FRAME_SUBTYPE_MASK;
    }
    else if(!strcmp((char*)filterType, (char*)PATTERN_str))
    {
        patternLen = strlen(cValue);

        /* Check offset validity */
        if((offset < 0) || (offset > (MAX_PAYLOAD_SIZE - patternLen)))
        {
            UART_PRINT(
                "\r\n [Cmd Parser] : For pattern matching filter, you must"
                " enter valid offset in packet:"
                "[0, max payload length - pattern length]\n\r");
            return(-1);
        }
        else
        {
            CreateFilterParams->rule.Header.Args.Value.Pattern.Offset = offset;

            /* Check pattern validity */
            if((patternLen <= 16) && (patternLen != 0))
            {
                memcpy(
                    &CreateFilterParams->rule.Header.Args.Value.Pattern.Value,
                    cValue,
                    CreateFilterParams->rule.Header.Args.Value.Pattern.Length);
                CreateFilterParams->rule.Header.Args.Value.Pattern.Length =
                    (patternLen - 1);
            }
            else
            {
                UART_PRINT(
                    "\r\n [Cmd Parser] : pattern length argument is invalid."
                    " should be in range: [1, 16]\n\r");
                return(-1);
            }
            CreateFilterParams->rule.Header.Args.Value.Pattern.Reserved = 0;

            /* This mask determines which part of
            the 16 byte pattern would be checked,
            to enable partial comparison */
            memset(&CreateFilterParams->rule.Header.Args.Mask, 0xFF, 16);
        }
    }
    else
    {
        UART_PRINT(
            "\r\n [Cmd Parser] : Invalid filter type.\n\r Filter types are:"
            " [S_MAC, D_MAC, BSSID, S_IP, D_IP, "
            "FRAME_TYPE, FRAME_SUBTYPE].\n\r");
        return(-1);
    }

    CreateFilterParams->trigger.Counter = SL_WLAN_RX_FILTER_NO_TRIGGER_COUNTER;

