TexasInstruments/cc32xx_open_sdk/examples/rtos/CC3220SF_LAUNCHXL/demos/network_terminal/cmd_parser.c
    /* If host event was selected, take the event ID: */
    if(hostEvent)
    {
        UART_PRINT(
            "\r\n [Cmd Parser] : Please enter user ID, in range: [0,63]"
            " (needed for Host event action).\n\r");
        UART_PRINT(cmdPromptStr);
        ret = GetCmd((char *)cmdStr, CMD_BUFFER_LEN);
        token = strtok(cmdStr, " ");
        if(token)
        {
            CreateFilterParams->action.UserId = (uint8_t)atol(token);
        }
        else
        {
            UART_PRINT(
                "\n\r [Cmd Parser]: Invalid range.\n\rrange: [0,63]"
                " (needed for Host event action).\n\r");
            return(-1);
        }
    }

    return(0);
}

/*!
    \brief          Parse enable WowLan command.

    This routine takes a WoWLANEnableCmd_t structure,
    and fill it's content with
    parameters taken from command line.
    It checks the parameters validity.
    In case of a parsing error or invalid parameters,
    this function prints help menu.

    \param          arg                 -   Points to command line buffer.
                                            Contains the command line
                                            typed by user.

    \param          WoWLANEnableParams  -   Points to command
                                            structure provided
                                            by the WowLan callback.
                                            This structure will later
                                            be read by the
                                            the WowLan callback.

    \return         Upon successful completion,
                    the function shall return 0.
                    In case of failure,
                    this function would print error, and show
                    the set enablewowlan command help menu.

    \sa             cmdEnableWoWLANCallback
 */
int32_t ParseEnableWoWLANCmd(void *arg,
                             WoWLANEnableCmd_t *WoWLANEnableParams)
{
    char cmdStr[CMD_BUFFER_LEN + 1];
    char                          *token = NULL;
    uint16_t offset = 0;
    uint8_t actionID = 0;
    uint8_t help = FALSE;
    uint8_t wowStr = FALSE;

    strncpy(cmdStr, (char*)arg, CMD_BUFFER_LEN);
    cmdStr[CMD_BUFFER_LEN] = '\0';
    token = strtok(cmdStr, space_str);

    if(token == NULL)
    {
        help = TRUE;
    }

    while(token)
    {
        if(!strcmp(token, (char*)help_optionStr))
        {
            help = TRUE;
        }
        else if(!strcmp(token, (char*)v_optionStr))
        {
            token = strtok(NULL, (char*)space_str);
            if(token)
            {
                if(*token != '"')
                {
                    UART_PRINT(
                        "\n\r[cmd parser] : enablewowlan expects the pattern"
                        " value in quotation marks (/"
                        ").\r\n");
                    help = TRUE;
                    break;
                }

                token++;

                WoWLANEnableParams->rule.Header.Args.Value.Pattern.Length =
                    (strlen(token) - 1);
                if(WoWLANEnableParams->rule.Header.Args.Value.Pattern.Length <=
                   16)
                {
                    memcpy(
                        &WoWLANEnableParams->rule.Header.Args.Value.Pattern.
                        Value,
                        token,
                        WoWLANEnableParams->rule.Header.Args.Value.Pattern.
                        Length);
                }
                else
                {
                    SHOW_WARNING(-1, CMD_ERROR);
                    help = TRUE;
                    break;
                }
                /* This mask determines which filters would be triggered */
                memset(&WoWLANEnableParams->rule.Header.Args.Mask, 0xFF, 16);
                wowStr = TRUE;
            }
        }
        else if(!strcmp(token, (char*)i_optionStr))
        {
            token = strtok(NULL, (char*)space_str);

            if(token)
            {
                offset = (uint16_t)atol((const char*)token);
                WoWLANEnableParams->rule.Header.Args.Value.Pattern.Offset =
                    offset;
            }
            else
            {
                WoWLANEnableParams->rule.Header.Args.Value.Pattern.Offset = 0;
            }

            WoWLANEnableParams->rule.Header.Args.Value.Pattern.Reserved = 0;
        }
        else if(!strcmp(token, (char*)u_optionStr))
        {
            token = strtok(NULL, (char*)space_str);

            if(token)
            {
                /* this sets the action as Host event,
                and UserId sets the bit corresponding to the filter */
                WoWLANEnableParams->action.UserId = (uint8_t)atol(token);
                actionID = TRUE;
            }
        }
        else
        {
            SHOW_WARNING(-1, CMD_ERROR);
            help = TRUE;
            break;
        }
        token = strtok(NULL, " ");
    }

    if(!wowStr || !actionID)
    {
        help = TRUE;
    }

    if(help)
    {
        printEnableWoWLANUsage(arg);
        return(-1);
    }

    return(0);
}

/*!
    \brief          Parse Ping command.

    This routine takes a PingCmd_t structure,
    and fill it's content with
    parameters taken from command line.
    It checks the parameters validity.
    In case of a parsing error or invalid parameters,
    this function prints help menu.

    \param          arg         -   Points to command line buffer.
                                    Contains the command line typed by user.

    \param          pingParams  -   Points to command structure provided
                                    by the Ping callback.
                                    This structure will later be read
                                    by the the Ping callback.

    \return         Upon successful completion, the function shall return 0.
                    In case of failure,
                    this function would print error, and show
                    the set Ping command help menu.

    \sa             cmdPingCallback
 */
int32_t ParsePingCmd(void *arg,
                     PingCmd_t *pingParams)
{
    int32_t n;
    char            *token = NULL;
    char            *host = NULL;
    char            *r_name = NULL;
    char cmdStr[CMD_BUFFER_LEN + 1];
    uint8_t help = FALSE;

    /* Fill ping parameters with default values */
    pingParams->pingCmd.PingIntervalTime = 1000;
    pingParams->pingCmd.PingSize = 56;
    pingParams->pingCmd.PingRequestTimeout = 3000;
    pingParams->pingCmd.TotalNumberOfAttempts = 10;
    /* Report after each ping packet is successful */
    pingParams->pingCmd.Flags = 1;

    strncpy(cmdStr, (char*)arg, CMD_BUFFER_LEN);
    cmdStr[CMD_BUFFER_LEN] = '\0';
    token = strtok(cmdStr, space_str);

