TexasInstruments/cc32xx_open_sdk/examples/rtos/CC3220SF_LAUNCHXL/demos/network_terminal/cmd_parser.c
    if(NULL == token)
    {
        help = TRUE;
    }

    while(token)
    {
        if(!strcmp(token, help_optionStr))
        {
            help = TRUE;
        }
        else if(!strcmp(token, h_optionStr))
        {
            host = strtok(NULL, space_str);
        }
        else if(!strcmp(token, c_optionStr))
        {
            token = strtok(NULL, space_str);
            if(token != NULL)
            {
                n = atol(token);
                if((n > 0) && (n < MAX_PING_SIZE))
                {
                    pingParams->pingCmd.TotalNumberOfAttempts = n;
                }
                else
                {
                    UART_PRINT(
                        "\n\r[Cmd Parser]: 'Num of packets' argument is"
                        " invalid. Using default: (10).\n\r");
                }
            }
        }
        else if(!strcmp(token, i_optionStr))
        {
            token = strtok(NULL, space_str);
            if(token != NULL)
            {
                n = atol(token);
                if(n > 0)
                {
                    pingParams->pingCmd.PingIntervalTime = 1000 * n;
                }
                else
                {
                    UART_PRINT(
                        "\n\r[Cmd Parser]: 'delay interval' argument is"
                        " invalid. Using default: (1 sec).\n\r");
                }
            }
        }
        else if(!strcmp(token, s_optionStr))
        {
            token = strtok(NULL, space_str);
            if(token != NULL)
            {
                n = atol(token);
                if(n > 0)
                {
                    pingParams->pingCmd.PingSize = n;
                }
                else
                {
                    UART_PRINT(
                        "\n\r[Cmd Parser]: 'data size' argument is"
                        " invalid. Using default: (56).\n\r");
                }
            }
        }
        else if(!strcmp(token, t_optionStr))
        {
            token = strtok(NULL, space_str);
            if(token != NULL)
            {
                n = atol(token);
                if(n > 0)
                {
                    pingParams->pingCmd.PingRequestTimeout = n * 1000;
                }
                else
                {
                    UART_PRINT(
                        "\n\r[Cmd Parser]: 'timeout' argument is invalid."
                        " Using default: (3 seconds per ping packet).\n\r");
                }
            }
        }
        else
        {
            SHOW_WARNING(-1, CMD_ERROR);
            help = TRUE;
            break;
        }
        token = strtok(NULL, " ");
    }

    if(!host)
    {
        UART_PRINT(
            "\n\r[Cmd Parser]: Parser is expecting host name / IP address\n\r");
        help = TRUE;
    }
    else
    {
        r_name = strstr((const char *)host, "www.");

        if(!r_name)
        {
            r_name = host;
        }

        pingParams->host = calloc(sizeof(uint8_t), strlen(r_name));
        strcpy((char *)pingParams->host, r_name);
    }

    if(help)
    {
        printPingUsage(arg);
        return(-1);
    }

    return(0);
}

/*!
    \brief          Free Ping command.

    This routine takes a PingCmd_t structure, and free all memory that was
    allocated in ParsePingCmd.

    \param          pingParams  -   Points to command structure provided by the
                                    ping callback.

    \return         void

    \sa             cmdPingCallback
 */
void FreePingCmd(PingCmd_t *pingParams)
{
    if(pingParams->host != NULL)
    {
        free(pingParams->host);
        pingParams->host = NULL;
    }

    return;
}

/*!
    \brief          Parse mDNS advertise command.

    This routine takes a mDnsAdvertiseCmd_t structure,
    and fill it's content with
    parameters taken from command line. It checks the
    parameters validity.
    In case of a parsing error or invalid parameters,

    this function prints help menu.
    \param          arg                  -   Points to
                                             command line buffer.
                                             Contains the command
                                             line typed by user.

    \param          mDNSAdvertiseParams  -   Points to command structure
                                             provided by the mDNS
                                             advertise callback.
                                             This structure will later be
                                             read by the the mDNS
                                             advertise callback.

    \return         Upon successful completion,
                    the function shall return 0.
                    In case of failure, this function
                    would print error, and show
                    the set mDNS advertise command help menu.

    \sa             mDNSAdvertiseCallback
 */
int32_t ParsemDNSAdvertiseCmd(void *arg,
                              mDnsAdvertiseCmd_t *mDNSAdvertiseParams)
{
    int32_t length = -1;
    uint32_t help = FALSE;

    /* Fill default parameters */
    mDNSAdvertiseParams->service_port = DEF_ADVERTISE_PORT;
    mDNSAdvertiseParams->service_ttl = DEF_ADVERTISE_TTL;

    char            *service_name = NULL;
    char            *adv_text = NULL;
    char            *p_adv_service_over = NULL;
    char            *adv_service_type = NULL;
    char            *token = NULL;
    char cmdStr[CMD_BUFFER_LEN + 1];

    strncpy(cmdStr, (char*)arg, CMD_BUFFER_LEN);
    cmdStr[CMD_BUFFER_LEN] = '\0';
    token = strtok(cmdStr, space_str);

    while(token)
    {
        if(!strcmp(token, help_optionStr))
        {
            help = TRUE;
        }
        else if(!strcmp(token, n_optionStr))
        {
            service_name = strtok(NULL, space_str);
        }
        else if(!strcmp(token, st_optionStr))
        {
            adv_service_type = strtok(NULL,space_str);
        }
        else if(!strcmp(token, so_optionStr))
        {
            p_adv_service_over = strtok(NULL, space_str);
        }
        else if(!strcmp(token, t_optionStr))
        {
            adv_text = strtok(NULL, "\"");
        }
        else if(!strcmp(token, p_optionStr))
        {
            token = strtok(NULL, space_str);
            if(token)
            {
                mDNSAdvertiseParams->service_port = (uint16_t)atoi(token);
            }
            else
            {
                UART_PRINT(
                    "\n\r[Cmd Parser]: Service port was not set,"
                    " using default parameter: %d\n\r",
                    mDNSAdvertiseParams->service_port);
            }
        }
        else if(!strcmp(token, ttl_optionStr))
        {
            token = strtok(NULL, space_str);
            if(token)
            {
                mDNSAdvertiseParams->service_ttl = (uint32_t)atoi(token);
            }
            else
            {
                UART_PRINT(
                    "\n\r[Cmd Parser]: Service ttl was not set, "
                    "using default parameter: %d\n\r",
                    mDNSAdvertiseParams->service_ttl);
            }
            if(!mDNSAdvertiseParams->service_ttl)
            {
                mDNSAdvertiseParams->service_ttl = DEF_ADVERTISE_TTL;
            }
        }
        else
        {
            SHOW_WARNING(-1, CMD_ERROR);
            help = TRUE;
            break;
        }
        token = strtok(NULL, " ");
    }

    /* Sanity check the parameters */
    if(help || (!p_adv_service_over)  || (!service_name) || (!adv_service_type))
    {
        printmDNSAdvertiseUsage(arg);
        return(-1);
    }

    /* Copy the text */
    if(adv_text)
    {
        mDNSAdvertiseParams->adv_text =
            (uint8_t *)calloc(sizeof(uint8_t), strlen(
                                  adv_text));
        strcpy((char *)mDNSAdvertiseParams->adv_text, adv_text);
    }
    if(service_name)
    {
        mDNSAdvertiseParams->dev_name =
            (uint8_t *)calloc(sizeof(uint8_t), strlen(
                                  service_name));
        strcpy((char *)mDNSAdvertiseParams->dev_name, service_name);
    }

    /* Compose the advertise address from it's parts:
    name, service type and protocol */
    length =
        mDNScreateServiceName(service_name, p_adv_service_over,
                              adv_service_type,
                              (char *)&mDNSAdvertiseParams->service_name);

    if(length < 0)
    {
        return(-1);
    }

    return(0);
}

/*!
    \brief          Free mDNS advertise command.

