TexasInstruments/cc32xx_open_sdk/examples/rtos/CC3220SF_LAUNCHXL/demos/network_terminal/cmd_parser.c
    This routine takes a mDnsAdvertiseCmd_t structure,
    and free all memory that was
    allocated in ParsemDNSAdvertiseCmd.

    \param          mDNSAdvertiseParams  -   Points to command structure
                                provided by the mDNSAdvertise callback.

    \return         void

    \sa             mDNSAdvertiseCallback
 */
void FreemDNSAdvertiseCmd(mDnsAdvertiseCmd_t *mDNSAdvertiseParams)
{
    if(mDNSAdvertiseParams->adv_text != NULL)
    {
        free(mDNSAdvertiseParams->adv_text);
        mDNSAdvertiseParams->adv_text = NULL;
    }

    if(mDNSAdvertiseParams->dev_name != NULL)
    {
        free(mDNSAdvertiseParams->dev_name);
        mDNSAdvertiseParams->dev_name = NULL;
    }

    return;
}

/*!
    \brief          Parse mDNS query command.

    This routine takes a mDnsQueryCmd_t structure, and fill it's content with
    parameters taken from command line. It checks the parameters validity.
    In case of a parsing error or invalid parameters,
    this function prints help menu.

    \param          arg             -   Points to command line buffer.
                                        Contains the command line
                                        typed by user.

    \param          QueryCmdParams  -   Points to command structure provided
                                        by the mDNS query callback.
                                        This structure will later be read by
                                        the the mDNS query callback.

    \return         Upon successful completion, the function shall return 0.
                    In case of failure, this function would print error,
                    and show the mDNS query command help menu.

    \sa             mDNSQueryCallback
 */
int32_t ParsemDNSQueryCmd(void *arg,  mDnsQueryCmd_t *QueryCmdParams)
{
    char            *service_name[3] = {0};
    char            *token = NULL;
    char cmdStr[CMD_BUFFER_LEN + 1];
    int8_t help = FALSE;
    int32_t ret;

    strncpy(cmdStr, (char*)arg, CMD_BUFFER_LEN);
    cmdStr[CMD_BUFFER_LEN] = '\0';
    token = strtok(cmdStr, space_str);

    while(token)
    {
        if(!strcmp(token, help_optionStr))
        {
            help = TRUE;
        }
        else if(!strcmp(token, n_optionStr))
        {
            service_name[0] = strtok(NULL, space_str);
        }
        else if(!strcmp(token, st_optionStr))
        {
            service_name[1] = strtok(NULL, space_str);
        }
        else if(!strcmp(token, so_optionStr))
        {
            service_name[2] = strtok(NULL, space_str);
        }
        else if(!strcmp(token, o_optionStr))
        {
            token = strtok(NULL, space_str);
            if(token)
            {
                if(!strcmp(token, "YES") || !strcmp(token, "yes"))
                {
                    QueryCmdParams->OneShotFlag = TRUE;
                }
            }
        }
        else
        {
            SHOW_WARNING(-1, CMD_ERROR);
            help = TRUE;
            break;
        }

        token = strtok(NULL, " ");
    }

    /* Perform input validation */
    if((help) || (service_name[1] == NULL) || (service_name[2] == NULL) ||
       (!IS_CONNECTED(app_CB.Status)))
    {
        printmDNSQueryUsage(arg);
        return(-1);
    }

    /* Compose the mDNS service name */
    ret =
        mDNScreateServiceName(
        service_name[0],
        service_name[2],
        service_name[1],
        (char *)&QueryCmdParams->ServiceName);

    if(ret <= 0)
    {
        printmDNSQueryUsage(arg);
        return(-1);
    }

    return(0);
}

/*!
    \brief          Compose mDNS advertise address.

    This routine takes individual strings, which represent
    each part of a mDNS advertise address
    and put them together in order to create one mDNS address.
    The Address is null terminated and allocated
    by the caller.

    \param          p_sevName           -   Points to a string
                                            containing device name. ex:'PC1'

    \param          p_servOver          -   Points to a string containing
                                            protocol for this service. ex:'tcp'

    \param          p_servType          -   Points to a string containing
                                            service type. ex: 'http'

    \param          p_adv_service_name  -   Container to store the
                                            advertise service name.
                                            mDNS service names
                                            are of the following form:
                                            'PC1._http._tcp.local'.

    \return         Upon successful completion, the function shall return
                    the length of the composed name,
                    and place it in the provided container. The caller is
                    responsible to maintain this container.

    \note           mDNS advertise length, is max MAX_SERVICE_NAME_LENGTH
                    (63) 64 including null termination character.
                    Also, this function doesn't check for input validity,
                    since all caller functions provide valid parameters.

    \sa             ParsemDNSAdvertiseCmd, ParsemDNSQueryCmd
 */
int32_t mDNScreateServiceName(char *p_sevName,
                              char *p_servOver,
                              char *p_servType,
                              char *p_adv_service_name)
{
    int32_t str_len = -1;
    char        *point = "._";
    char        *space = "_";
    char        *spoint = ".";
    char        *local = "local";

    /* query can be partial - without name.
     *  for example: _http._tcp.local -
     *  find available http servers over tcp
     */
    if(p_sevName != NULL)
    {
        str_len = strlen(p_sevName) + strlen(spoint);
    }

    str_len += (strlen(p_servOver) + strlen(p_servType) + strlen(local) + 5);

    memset(p_adv_service_name, 0x0, str_len);

    if(p_sevName != NULL)
    {
        strcat(p_adv_service_name, p_sevName);
        strcat(p_adv_service_name, (const char*)spoint);
    }

    strcat(p_adv_service_name, (const char*)space);
    strcat(p_adv_service_name, (const char*)p_servType);
    strcat(p_adv_service_name, (const char*)point);
    strcat(p_adv_service_name, (const char*)p_servOver);
    strcat(p_adv_service_name, (const char*)spoint);
    strcat(p_adv_service_name, (const char*)local);
    strcat(p_adv_service_name, (const char*)"\0");

    return(str_len);
}

/*!
    \brief          Parse Send command.

    This routine takes a SendCmd_t structure,
    and fill it's content with
    parameters taken from command line.
    It checks the parameters validity.
    In case of a parsing error or invalid parameters,
    this function prints help menu.

    \param          arg             -   Points to command line buffer.
                                        Contains the command
                                        line typed by user.

    \param          SendCmdParams   -   Points to command structure
                                        provided by the Send callback.
                                        This structure will later be
                                        read by the the Send callback.

    \return         Upon successful completion, the function shall return 0.
                    In case of failure,
                    this function would print error, and show
                    the Send command help menu.

    \sa             cmdSendCallback
 */
int32_t ParseSendCmd(void *arg,  SendCmd_t *SendCmdParams)
{
    int32_t ret = 0;
    int8_t help = FALSE;
    char                    *ip = NULL;
    char                    *token = NULL;
    char cmdStr[CMD_BUFFER_LEN + 1];

    strncpy(cmdStr, (char*)arg, CMD_BUFFER_LEN);
    cmdStr[CMD_BUFFER_LEN] = '\0';
    token = strtok(cmdStr, space_str);

    /* Fill default to structures */
    SendCmdParams->numberOfPackets = 1000;
    SendCmdParams->udpFlag = FALSE;
    SendCmdParams->server = TRUE;
    SendCmdParams->nb = FALSE;
    SendCmdParams->ipv6 = FALSE;
    SendCmdParams->ip = NULL;

