TexasInstruments/cc32xx_open_sdk/examples/rtos/CC3220SF_LAUNCHXL/demos/network_terminal/cmd_parser.c
    if(token == NULL)
    {
        help = TRUE;
    }

    while(token)
    {
        if(!strcmp(token, help_optionStr))
        {
            help = TRUE;
        }
        else if(!strcmp(token, u_optionStr))
        {
            SendCmdParams->udpFlag = TRUE;
        }
        else if(!strcmp(token, s_optionStr))
        {
            SendCmdParams->server = TRUE;
        }
        else if(!strcmp(token, V_optionStr))
        {
            SendCmdParams->ipv6 = TRUE;
        }
        else if(!strcmp(token, nb_optionStr))
        {
            SendCmdParams->nb = TRUE;
        }
        else if(!strcmp(token, p_optionStr))
        {
            token = strtok(NULL, space_str);
            if(token)
            {
                SendCmdParams->portNumber = (unsigned short)atol(token);
            }
            else
            {
                UART_PRINT(
                    "\n\r[cmd Parser] : Port number was not set, "
                    "using default parameter: %d\n\r",
                    SendCmdParams->portNumber);
            }
        }
        else if(!strcmp(token, c_optionStr))
        {
            ip = (char*)strtok(NULL, space_str);
            if((ip != NULL) && (SendCmdParams->ip == NULL))
            {
                SendCmdParams->ip =
                    (uint8_t *)calloc(sizeof(uint8_t), strlen((const char*)ip));
                strcpy((char *)SendCmdParams->ip, ip);
            }
            else
            {
                UART_PRINT("\n\r[cmd Parser] : Invalid IP\n\r");
                return(-1);
            }

            SendCmdParams->server = FALSE;
        }
        else if(!strcmp(token, n_optionStr))
        {
            token = strtok(NULL, space_str);
            if(token)
            {
                SendCmdParams->numberOfPackets = atol(token);
            }
            else
            {
                UART_PRINT(
                    "\n\r[cmd Parser] : Number Of Packets was not set, "
                    "using default parameter: %d\n\r",
                    SendCmdParams->numberOfPackets);
            }
        }
        else
        {
            SHOW_WARNING(-1, CMD_ERROR);
            help = TRUE;
            break;
        }
        token = strtok(NULL, space_str);
    }

    if(help)
    {
        ret = printSendUsage(arg);
        return(-1);
    }

    if(!SendCmdParams->server)
    {
        token = NULL;
        token = strchr((const char*)SendCmdParams->ip, ':');
        if(token)
        {
            ret = ipv6AddressParse((char*)SendCmdParams->ip,
                                   (uint8_t*)&SendCmdParams->ipAddr.ipv6);
            SendCmdParams->ipv6 = TRUE;
        }
        else
        {
            ret = ipv4AddressParse((char*)SendCmdParams->ip,
                                   (uint32_t*)&SendCmdParams->ipAddr.ipv4);
            SendCmdParams->ipv6 = FALSE;
        }
    }

    if(ret < 0)
    {
        UART_PRINT("\n\r[cmd Parser] : Invalid IP\n\r");
        return(-1);
    }

    /* Perform a sanity check, since the device has
    to be connected in order to send packets. */
    if(SendCmdParams->ipv6)
    {
        if(!IS_IPV6G_ACQUIRED(app_CB.Status) &&
           !IS_IPV6L_ACQUIRED(app_CB.Status) && !IS_CONNECTED(app_CB.Status))
        {
            UART_PRINT(
                "\n\r[cmd Parser] : (error) Cannot send data if device is "
                "disconnected from network.\n\r");
            return(-1);
        }
    }
    else
    {
        if(!IS_IP_ACQUIRED(app_CB.Status) && !IS_CONNECTED(app_CB.Status))
        {
            UART_PRINT(
                "\n\r[cmd Parser] : (error) Cannot send data if device is "
                "disconnected from network.\n\r");
            return(-1);
        }
    }

    if(SendCmdParams->numberOfPackets <= 0)
    {
        SendCmdParams->numberOfPackets = 1000;
    }

    if(SendCmdParams->portNumber <= 0)
    {
        SendCmdParams->portNumber = 5001;
    }

    UART_PRINT("\n\r");
    UART_PRINT("Protocol: %s\n\r", SendCmdParams->udpFlag ? "udp" : "tcp");
    UART_PRINT("Traffic: Tx\n\r");
    UART_PRINT("Client\\Server: ");

    if(SendCmdParams->server)
    {
        UART_PRINT("Server\n\r");
    }
    else
    {
        UART_PRINT("Client\n\r");

        if(SendCmdParams->ipv6)
        {
            PrintIPAddress(SendCmdParams->ipv6,
                           (void*)&SendCmdParams->ipAddr.ipv6);
            UART_PRINT(lineBreak);
        }
        else
        {
            PrintIPAddress(SendCmdParams->ipv6,
                           (void*)&SendCmdParams->ipAddr.ipv4);
            UART_PRINT(lineBreak);
        }
    }

    UART_PRINT("Port: %d\n\r", SendCmdParams->portNumber);
    UART_PRINT("Number of Packets to send: %d\n\r",
               SendCmdParams->numberOfPackets);
    UART_PRINT("\n\r");

    return(0);
}

/*!
    \brief          Free Send command.

    This routine takes a SendCmd_t structure, and free all memory that was
    allocated in ParseSendCmd.

    \param          SendCmdParams  -   Points to command
                                       structure provided by the send callback.

    \return         void

    \sa             cmdSendCallback
 */
void FreeSendCmd(SendCmd_t *SendCmdParams)
{
    if(SendCmdParams->ip != NULL)
    {
        free(SendCmdParams->ip);
        SendCmdParams->ip = NULL;
    }

    return;
}

/*!
    \brief          Parse Receive command.

    This routine takes a RecvCmd_t structure, and fill it's content with
    parameters taken from command line. It checks the parameters validity.
    In case of a parsing error or invalid parameters,
    this function prints help menu.

    \param          arg             -   Points to command line buffer.
                                        Contains the command line
                                        typed by user.

    \param          RecvCmdParams   -   Points to command structure provided
                                        by the Recv callback.
                                        This structure will later be read
                                        by the the Recv callback.

    \return         Upon successful completion, the function shall return 0.
                    In case of failure, this function would print error,
                    and show the Send command help menu.

    \sa             cmdRecvCallback
 */
int32_t ParseRecvCmd(void *arg,  RecvCmd_t *RecvCmdParams)
{
    int32_t ret = 0;
    int8_t help = FALSE;
    char                    *ip = NULL;
    char                    *token = NULL;
    char cmdStr[CMD_BUFFER_LEN + 1];

    strncpy(cmdStr, (char*)arg, CMD_BUFFER_LEN);
    cmdStr[CMD_BUFFER_LEN] = '\0';
    token = strtok(cmdStr, space_str);

    /* Fill default to structures */
    RecvCmdParams->numberOfPackets = 1000;
    RecvCmdParams->udpFlag = FALSE;
    RecvCmdParams->server = TRUE;
    RecvCmdParams->nb = FALSE;
    RecvCmdParams->ipv6 = FALSE;
    RecvCmdParams->portNumber = 5001;
    RecvCmdParams->ip = NULL;

    strncpy(cmdStr, (char*) arg, CMD_BUFFER_LEN);
    cmdStr[CMD_BUFFER_LEN] = '\0';
    token = strtok(cmdStr, space_str);

