TexasInstruments/cc32xx_open_sdk/examples/rtos/CC3220SF_LAUNCHXL/demos/network_terminal/cmd_parser.c
    if(token == NULL)
    {
        help = TRUE;
    }

    while(token)
    {
        if(!strcmp(token, help_optionStr))
        {
            help = TRUE;
        }
        else if(!strcmp(token, u_optionStr))
        {
            RecvCmdParams->udpFlag = TRUE;
        }
        else if(!strcmp(token, s_optionStr))
        {
            RecvCmdParams->server = TRUE;
        }
        else if(!strcmp(token, V_optionStr))
        {
            RecvCmdParams->ipv6 = TRUE;
        }
        else if(!strcmp(token, nb_optionStr))
        {
            RecvCmdParams->nb = TRUE;
        }
        else if(!strcmp(token, p_optionStr))
        {
            token = strtok(NULL, space_str);
            if(token)
            {
                RecvCmdParams->portNumber = (unsigned short)atol(token);
            }
            else
            {
                UART_PRINT(
                    "\n\r[cmd Parser] : Port number was not set, using default"
                    " parameter: %d\n\r",
                    RecvCmdParams->portNumber);
            }
        }
        else if(!strcmp(token, c_optionStr))
        {
            ip = (char*)strtok(NULL, space_str);
            if((ip != NULL) && (RecvCmdParams->ip == NULL))
            {
                RecvCmdParams->ip =
                    (uint8_t *)calloc(sizeof(uint8_t), strlen((const char*)ip));
                strcpy((char *)RecvCmdParams->ip, ip);
            }
            else
            {
                UART_PRINT("\n\r[cmd Parser] : Invalid IP\n\r");
                return(-1);
            }

            RecvCmdParams->server = FALSE;
        }
        else if(!strcmp(token, n_optionStr))
        {
            token = strtok(NULL, space_str);
            if(token)
            {
                RecvCmdParams->numberOfPackets = atol(token);
            }
            else
            {
                UART_PRINT(
                    "\n\r[cmd Parser] : Number Of Packets was not set, using"
                    " default parameter: %d\n\r",
                    RecvCmdParams->numberOfPackets);
            }
        }
        else
        {
            SHOW_WARNING(-1, CMD_ERROR);
            help = TRUE;
            break;
        }
        token = strtok(NULL, space_str);
    }

    if(help)
    {
        printRecvUsage(arg);
        return(-1);
    }

    if(!RecvCmdParams->server)
    {
        token = NULL;
        token = strchr((const char*)RecvCmdParams->ip, ':');
        if(token)
        {
            ret = ipv6AddressParse((char*)RecvCmdParams->ip,
                                   (uint8_t*)&RecvCmdParams->ipAddr.ipv6);
            RecvCmdParams->ipv6 = TRUE;
        }
        else
        {
            ret = ipv4AddressParse((char*)RecvCmdParams->ip,
                                   (uint32_t *)&RecvCmdParams->ipAddr.ipv4);
            RecvCmdParams->ipv6 = FALSE;
        }
    }

    /* Perform a sanity check,
       since the device has to be connected in order to send packets. */
    if(RecvCmdParams->ipv6)
    {
        if(!IS_IPV6G_ACQUIRED(app_CB.Status) &&
           !IS_IPV6L_ACQUIRED(app_CB.Status) && !IS_CONNECTED(app_CB.Status))
        {
            UART_PRINT(
                "\n\r[cmd Parser] : (error) Cannot receive data if device"
                " is disconnected from network.\n\r");
            return(-1);
        }
    }
    else
    {
        if(!IS_IP_ACQUIRED(app_CB.Status) && !IS_CONNECTED(app_CB.Status))
        {
            UART_PRINT(
                "\n\r[cmd Parser] : (error)Cannot send data if device"
                " is disconnected from network.\n\r");
            return(-1);
        }
    }

    if(ret < 0)
    {
        UART_PRINT("\n\r[cmd Parser] : Invalid IP\n\r");
        return(-1);
    }

    if(!RecvCmdParams->numberOfPackets)
    {
        RecvCmdParams->numberOfPackets = 1000;
    }

    if(RecvCmdParams->portNumber <= 0)
    {
        RecvCmdParams->portNumber = 5001;
    }

    UART_PRINT("\n\r");
    UART_PRINT("Protocol: %s\n\r", RecvCmdParams->udpFlag ? "udp" : "tcp");
    UART_PRINT("Traffic: Rx\n\r");
    UART_PRINT("Client\\Server: ");

    if(RecvCmdParams->server)
    {
        UART_PRINT("Server\n\r");
    }
    else
    {
        UART_PRINT("Client\n\r");
        UART_PRINT("Client IP: ");

        if(RecvCmdParams->ipv6)
        {
            PrintIPAddress(RecvCmdParams->ipv6,
                           (void*)&RecvCmdParams->ipAddr.ipv6);
        }
        else
        {
            PrintIPAddress(RecvCmdParams->ipv6,
                           (void*)&RecvCmdParams->ipAddr.ipv4);
        }

        UART_PRINT(lineBreak);
    }

    UART_PRINT("Port: %d\n\r", RecvCmdParams->portNumber);
    UART_PRINT("Number of Packets to receive: %d\n\r",
               RecvCmdParams->numberOfPackets);
    UART_PRINT("\n\r");

    return(0);
}

/*!
    \brief          Parse Soft Roaming Enable command.

    This routine takes the RssiThreshold parameter, and fill it's content with
    parameters taken from command line. It checks the parameters validity.
    In case of a parsing error or invalid parameters, this function
    prints help menu.

    \param          arg             -   Points to command line buffer.
                                        Contains the command line
                                        typed by user.

    \param          RssiThreshold   -   Input event Threshold.
                                        Units: dBm / dB ; Range: (-100 .. 100)

    \return         Upon successful completion, the function shall return 0.
                    In case of failure, this function would print error,
                    and show the SoftRoamingEnable command help menu.

    \sa             cmdSoftRoamingEnableCallback
 */
int32_t ParseSoftRoamingEnableCmd(void *arg, uint32_t *RssiThreshold)
{
    char    *token = NULL;
    char cmdStr[CMD_BUFFER_LEN + 1];
    uint8_t help = FALSE;

    strncpy(cmdStr, (char*)arg, CMD_BUFFER_LEN);
    cmdStr[CMD_BUFFER_LEN] = '\0';
    token = strtok(cmdStr, space_str);

