TexasInstruments/cc32xx_open_sdk/examples/rtos/CC3220SF_LAUNCHXL/demos/network_terminal/cmd_parser.c
    if(NULL == token)
    {
        help = TRUE;
    }

    while(token)
    {
        if(!strcmp(token, help_optionStr))
        {
            help = TRUE;
        }
        else if(!strcmp(token, r_optionStr))
        {
            token = strtok(NULL, space_str);
            if(token)
            {
                *RssiThreshold = (int32_t)atoi(token);
            }
        }
        else
        {
            SHOW_WARNING(-1, CMD_ERROR);
            help = TRUE;
            break;
        }
        token = strtok(NULL, " ");
    }

    if(help)
    {
        printSoftRoamingEnableUsage(arg);
        return(-1);
    }

    return(0);
}

/*!
    \brief          Parse Set Country Code command.

    This routine parse set country code parameters.
    In case of a parsing error or invalid parameters,
    this function prints help menu.

    \param          arg             -   Points to command line buffer.
                                        Contains the command line typed by
                                        user.
                    InputPad        -   Pad number to assign for BLE input
                    OutputPad       -   Pad number to assign for RF switch
                                        control

    \return         Upon successful completion, the function shall return 0.
                    In case of failure, this function would print error,
                     and show the CoexEnable command help menu.

    \sa             ParseCountycodeCmd
 */

int32_t ParseCountycodeCmd(void *arg, uint8_t *country)
{
    char               *token = NULL;
    uint8_t            *country_input = NULL;
    char cmdStr[CMD_BUFFER_LEN + 1];
    uint8_t help = FALSE;

    strncpy(cmdStr, (char*)arg, CMD_BUFFER_LEN);
    cmdStr[CMD_BUFFER_LEN] = '\0';
    token = strtok(cmdStr, space_str);

    if(NULL == token)
    {
        help = TRUE;
    }

    while(token)
    {
        if(!strcmp(token, help_optionStr))
        {
            help = TRUE;
        }
        else if(!strcmp(token, g_optionStr))
        {
            token = strtok(NULL, space_str);
            if(token)
            {
                country_input = (uint8_t *)token;
            }
        }
        else
        {
            SHOW_WARNING(-1, CMD_ERROR);
            help = TRUE;
            break;
        }
        token = strtok(NULL, " ");
    }

    if(!country_input)
    {
        SHOW_WARNING(-1, CMD_ERROR);
        help = TRUE;
    }
    else
    {
        if(!((strlen((char *)country_input) == 2) &&
             (country_input[0] >= 'A') && (country_input[0] <= 'Z') &&
             (country_input[1] >= 'A') && (country_input[1] <= 'Z')))
        {
            UART_PRINT("\n\rInvalid input \n\r");
            help = TRUE;
        }
    }

    if(help)
    {
        printCountrycodeeUsage(arg);
        return(-1);
    }

    memcpy(country, country_input, 2);
    return(0);
}


/*!
    \brief          Parse Triggered Roaming Enable command.

    This routine takes the RssiThreshold parameter, and fill it's content with
    parameters taken from command line. It checks the parameters validity.
    In case of a parsing error or invalid parameters, this function
    prints help menu.

    \param          arg             -   Points to command line buffer.
                                        Contains the command line
                                        typed by user.

    \param          RssiThreshold   -   Input event Threshold.
                                        Units: dBm / dB ; Range: (-85 .. 0)

    \return         Upon successful completion, the function shall return 0.
                    In case of failure, this function would print error,
                    and show the TriggeredRoamingEnableEnable command help menu.

    \sa             cmdTriggeredRoamingEnablecallback
 */
int32_t ParseTriggeredRoamingEnableCmd(void *arg, int16_t *RssiThreshold)
{
    char    *token = NULL;
    char    cmdStr[CMD_BUFFER_LEN + 1];
    uint8_t help = FALSE;

    strncpy(cmdStr, (char*)arg, CMD_BUFFER_LEN);
    cmdStr[CMD_BUFFER_LEN] = '\0';
    *RssiThreshold = -63;
    token = strtok(cmdStr, space_str);

    if(NULL == token)
    {
        help = TRUE;
    }

    while(token)
    {
        if(!strcmp(token, help_optionStr))
        {
            help = TRUE;
        }
        else if(!strcmp(token, r_optionStr))
        {
            token = strtok(NULL, space_str);
            if(token)
            {
                *RssiThreshold = (int32_t)atoi(token);
                if ( (*RssiThreshold < -85) ||
                     (*RssiThreshold > 0) )
                {
                    UART_PRINT("\n\rInvalid input \n\r");
                    help = TRUE;
                }
            }
        }
        else
        {
            SHOW_WARNING(-1, CMD_ERROR);
            help = TRUE;
            break;
        }
        token = strtok(NULL, " ");
    }

    if(help)
    {
        printTriggeredRoamingEnableUsage(arg);
        return(-1);
    }

    return(0);
}






/*!
    \brief          Free Recv command.

    This routine takes a RecvCmd_t structure, and free all memory that was
    allocated in RecvCmdParams.

    \param          RecvCmdParams  -   Points to command
                                       structure provided by the send callback.

    \return         void

    \sa             cmdRecvCallback
 */
void FreeRecvCmd(RecvCmd_t *RecvCmdParams)
{
    if(RecvCmdParams->ip != NULL)
    {
        free(RecvCmdParams->ip);
        RecvCmdParams->ip = NULL;
    }

    return;
}
